class Translate_lng {
  static const Map<String, List<String>> translations = {
    "solutions": ["தீர்வுகள்", "పరిష్కారాలు", "समाधान"],
    "map": ["வரைபடம்", "మ్యాప్", "मानचित्र"],
    "plant-name": ["தாவரத்தின் பெயர்", "మొక్క పేరు", "पौधे का नाम"],
    "affected-area": ["பாதிக்கப்பட்ட பகுதி", "ప్రభావిత ప్రాంతం", "प्रभावित क्षेत्र"],
    "online": ["ஆன்லைன்", "ఆన్‌లైన్", "ऑनलाइन"],
    "offline": ["ஆஃப்லைன்", "ఆఫ్‌లైన్", "ऑफ़लाइन"],
    "name": ["பெயர்", "పేరు", "नाम"],
    "district": ["மாவட்டம்", "జిల్లా", "जिला"],
    "contact number": ["தொடர்பு எண்", "సంప్రదింపు నంబర్", "संपर्क नंबर"],
    "search": ["தேடு", "వెతుకు", "खोज"],
    "login": ["உள் நுழை", "లాగిన్", "लॉगिन"],
    "proceed": ["தொடரவும்", "ముందుకు సాగు", "आगे बढ़ें"],
    "back": ["பின்செல்", "వెనుకకు", "वापस"],
    "ok": ["சரி", "సరే", "ठीक है"],
    "logout": ["வெளியேறு", "లాగ్ అవుట్", "लॉगआउट"]
  };
}